python_multiprocessing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-16 Wed 12:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Multiprocessing in Python</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vaibhav Karve" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Multiprocessing in Python
<br />
<span class="subtitle"><a href="index.html">Home</a></span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org48bf515">1. Introduction</a></li>
<li><a href="#org953bcfe">2. Start methods</a>
<ul>
<li><a href="#orgf526d66">2.1. <code>spawn</code></a></li>
<li><a href="#org75e1b01">2.2. <code>fork</code></a></li>
<li><a href="#org6e87657">2.3. <code>forkserver</code></a></li>
<li><a href="#org7a5a8f3">2.4. Verdict</a></li>
</ul>
</li>
<li><a href="#org1c3cf92">3. Communication between processes</a>
<ul>
<li><a href="#org8137635">3.1. Queue</a></li>
</ul>
</li>
</ul>
</div>
</div>
<dl class="org-dl">
<dt>Python documentation</dt><dd><a href="https://docs.python.org/3/library/multiprocessing.html">multiprocessing module</a></dd>
</dl>

<div id="outline-container-org48bf515" class="outline-2">
<h2 id="org48bf515"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The <code>multiprocessing</code> module (MP) spawns sub-processes insteads of threads.  Can be
used for data parallelism &#x2013; parallelizing the execution of a function
accross multiple input values by distributing the data accross
processes.
</p>
</div>
</div>

<div id="outline-container-org953bcfe" class="outline-2">
<h2 id="org953bcfe"><span class="section-number-2">2</span> Start methods</h2>
<div class="outline-text-2" id="text-2">
<p>
Can be set as follows.
</p>
<div class="org-src-container">
<pre class="src src-python" id="org9143a2e"><span class="org-keyword">import</span> multiprocessing <span class="org-keyword">as</span> mp

<span class="org-keyword">def</span> <span class="org-function-name">foo</span>(q):
    <span class="org-keyword">pass</span>

<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> == <span class="org-string">'__main__'</span>:
    <span class="org-comment-delimiter"># </span><span class="org-comment">using get_context() is preferred over set_start_method().</span>
    <span class="org-variable-name">ctx</span> = mp.get_context(<span class="org-string">'spawn'</span>)  <span class="org-comment-delimiter"># </span><span class="org-comment">mp has custom Context object</span>
                                   <span class="org-comment-delimiter"># </span><span class="org-comment">types.</span>
    <span class="org-variable-name">q</span> = ctx.Queue()
    <span class="org-variable-name">p</span> = ctx.Process(target=foo, args=(q,))
</pre>
</div>



<p>
<code>set_start_method()</code> should not be used more than once in the program.
</p>
</div>

<div id="outline-container-orgf526d66" class="outline-3">
<h3 id="orgf526d66"><span class="section-number-3">2.1</span> <code>spawn</code></h3>
<div class="outline-text-3" id="text-2-1">
<p>
Parent process starts a fresh python interpreter each time. This is
the slowest option. Inherits only those objects that are needed by
the <code>multiprocessing.Process.run</code> method.
</p>
</div>
</div>

<div id="outline-container-org75e1b01" class="outline-3">
<h3 id="org75e1b01"><span class="section-number-3">2.2</span> <code>fork</code></h3>
<div class="outline-text-3" id="text-2-2">
<p>
Parent process forks the python interpreter using <code>os.fork()</code>. All
resources of the parent are inherited by the child process. This is
faster then <code>spawn</code>.
</p>

<p>
"Not safe if used on a multi-threading process" (I think this means
that this method should not be used if we are also using the
<code>threading</code> module?). Overall the fork start method can lead to
crashes of the subprocess so it is unsafe.
</p>

<p>
This is available on Unix only.
</p>
</div>
</div>

<div id="outline-container-org6e87657" class="outline-3">
<h3 id="org6e87657"><span class="section-number-3">2.3</span> <code>forkserver</code></h3>
<div class="outline-text-3" id="text-2-3">
<p>
When the program starts, using this method, a server process is
also started. The fork server can fork a new process every time it
is requested. The fork process server is single-threaded and so it
is safely uses <code>os.fork()</code>. No unnecessary resources are inherited
from the parent process.
</p>

<p>
Similar to <code>fork</code>, this is available on Unix only.
</p>
</div>
</div>

<div id="outline-container-org7a5a8f3" class="outline-3">
<h3 id="org7a5a8f3"><span class="section-number-3">2.4</span> Verdict</h3>
<div class="outline-text-3" id="text-2-4">
<p>
I will be using <code>forkserver</code> for my programs.
</p>
</div>
</div>
</div>

<div id="outline-container-org1c3cf92" class="outline-2">
<h2 id="org1c3cf92"><span class="section-number-2">3</span> Communication between processes</h2>
<div class="outline-text-2" id="text-3">
<p>
MP allows exchange of objects between processes.
</p>
</div>
<div id="outline-container-org8137635" class="outline-3">
<h3 id="org8137635"><span class="section-number-3">3.1</span> Queue</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Use <code>mp.Queue</code> instead of <code>queue.Queue</code>.
</p>

<p>
Steps:
</p>
<ol class="org-ol">
<li>Create a queue using <code>q = mp.Queue()</code>.</li>
<li><code>q.put([1, 'a', 2])</code> puts the list <code>[1, 'a', 2]</code> into the queue.</li>
<li><code>q.get()</code> retrieves whatever was put in the queue (I think it
retrieves in FIFO order?). This can be using in conjunction with
another function as in <code>len(q.get())</code> to get the length of our
list.</li>
</ol>
<div class="org-src-container">
<pre class="src src-python" id="org85c2dff"><span class="org-keyword">import</span> multiprocessing <span class="org-keyword">as</span> mp

<span class="org-variable-name">q</span> = mp.Queue()
<span class="org-keyword">print</span>(q)
q.put([1, <span class="org-string">'a'</span>, 2])
<span class="org-keyword">print</span>(<span class="org-builtin">len</span>(q.get()))
</pre>
</div>

<pre class="example">
&lt;multiprocessing.queues.Queue object at 0x7ff4e73a86d0&gt;
3

</pre>
</div>

<ol class="org-ol">
<li><a id="org50782af"></a>Putting many queues inside(?) a single process<br />
<div class="outline-text-4" id="text-3-1-1">
<ol class="org-ol">
<li>Start a process using <code>p = mp.Process(target=putter, arg=q)</code>, where
<code>putter</code> puts objects into the queue <code>q</code>.</li>
<li>Start the process: <code>p.start()</code>.</li>
<li>Intermediate action like requesting things from the queue.</li>
<li>Join after process termination: <code>p.join()</code>.</li>
</ol>

<div class="org-src-container">
<pre class="src src-python" id="org09dbb90"><span class="org-keyword">def</span> <span class="org-function-name">putter</span>(q: mp.queues.Queue, value):
    q.put(value)

<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> == <span class="org-string">'__main__'</span>:
    q: <span class="org-variable-name">mp.queues.Queue</span> = mp.Queue()

    p: <span class="org-variable-name">mp.Process</span> = mp.Process(target=putter, args=(q, [42, <span class="org-constant">None</span>, <span class="org-string">'hello'</span>]))

    p.start()
    <span class="org-keyword">print</span>(q.get())    <span class="org-comment-delimiter"># </span><span class="org-comment">prints "[42, None, 'hello']"</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">print(q.get)    # Running it again blocks the process for some reason.</span>
    p.join()
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vaibhav Karve</p>
<p class="date">Created: 2020-09-16 Wed 12:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
